Tekla.Structures.Drawing.InvalidTypeException
The InvalidTypeException class defines the exception that is
thrown when a type was not one of the allowed ones.

Tekla.Structures.Drawing.InvalidTypeException.#ctor(System.String)
Creates a new InvalidTypeException instance.

Tekla.Structures.Drawing.InvalidTypeException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Initializes a new instance with serialized data.
info: The object that holds the serialized object data.
context: The contextual information about the source or destination.